app/views/users/_unfollow.html.erb

<%= form_for current_user.relationships.find_by_followed_id(@user),:html => { :method => :delete }, :remote => true do |f| %>
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 2 AND ("relationships".follower_id = 1) LIMIT 1