app/views/users/show.html.erb

			<%= render 'follow_form' if signed_in? %>
			<% unless @user.microposts.empty? %>
---
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 2)