app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('Ok', 1, '2013-06-25 10:55:31.338849', '2013-06-25 10:55:31.338849')
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save