app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("nom", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('Clément Doumouro', 'clement.doumouro@gmail.com', '2013-06-21 17:58:22.870040', '2013-06-21 17:58:22.870040', 'a39f67ed38a13e1556acb59ae08a107a80a7de058d02d1bca4ebcf68d427b1ba', '03f6e9b22b122a7dbb46f7b3a5ab2899432bc35cedf1227c1481d39c411026e0', 'f')

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "encrypted_password" = '8e0fb59a5ccb1cf731c82407fa7584cd45fe5cd512a018f0ac4f9a6f9ea7af0c', "updated_at" = '2013-06-26 08:36:49.522605' WHERE "users"."id" = 1

  def index
    @titre = "Tous les utilisateurs"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def following
    @titre = "Following"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 101 LIMIT 1

  def followers
    @titre = "Followers"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 101 LIMIT 1